// *Задача 1
//* Напишите функцию checkValue(num), которая получает в качестве аргумента число
//* и вернет сообщение в лог по условию
//* Если число будет больше 10, в консоли выведите сообщение "Число больше 10",
//* В противно случае "Число меньше или равно 10"

// function checkValue(num) {
//   if (num > 10) {
// console.log("Число больше 10");
//   } else {
// console.log("число меньше или равно 10");
//   }
// }
// checkValue(9);

// function checkValue(num) {
// let result = num > 10 ? "Число больше 10" : "Число меньше или равно 10";
// console.log(result);
// }
// checkValue(9)
// checkValue(15)

//* Задача 2
//* Напишите функцию repeatLog(n), которая получает в качестве аргумента количество итераций (число)
//* Функция должна будет вывести в косноль сообщения согласно примеру:

// repeatLog(3)
// 'Сообщение 1'
// 'Сообщение 2'
// 'Сообщение 3'

// repeatLog(5)
// 'Сообщение 1'
// 'Сообщение 2'
// 'Сообщение 3'
// 'Сообщение 4'
// 'Сообщение 5'

// function repeatLog(n) {
//   for (let i = 1; i <= n; i++) {
// console.log(`Сообщение ${i}`);
//   }
// }
// repeatLog(3);
