//* Напишите функцию getSqrt(num), которая возвращает значение корня аргумента.

// Примечание:

// 1) Попробуйте не использовать в решение объект Math

// 2) Напишите решение используя все 3 вида функции

// function getSqrt(num) {
//   return num ** 0.5;
// }
//
// let getSqrt = (num) => num ** 0.5;
//
// let getSqrt = function (num) {
//   return num ** 0.5;
// };
//-------------------------------
//* Напишите функцию checkEven(n), которая будет возвращать булевыф тип с ответом на вопрос - явлеяется ли аргумент четным числовым значением

// Примечание: реализвать используя все 3 вида функций

function checkEven(n) {
  return n % 2 === 0;
}
let checkEven = (n) => n % 2 === 0;

let checkEven = function (n) {
  return n % 2 === 0;
};
